let msg = [
    "訂閱遊戲迪米",
    "記得寫你的作業",
    `⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠛⠛⠛⠋⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠙⠛⠛⠛⠿⠻⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠀⠀⠀⠀⠀⡀⠠⠤⠒⢂⣉⣉⣉⣑⣒⣒⠒⠒⠒⠒⠒⠒⠒⠀⠀⠐⠒⠚⠻⠿⠿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⠏⠀⠀⠀⠀⡠⠔⠉⣀⠔⠒⠉⣀⣀⠀⠀⠀⣀⡀⠈⠉⠑⠒⠒⠒⠒⠒⠈⠉⠉⠉⠁⠂⠀⠈⠙⢿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⠇⠀⠀⠀⠔⠁⠠⠖⠡⠔⠊⠀⠀⠀⠀⠀⠀⠀⠐⡄⠀⠀⠀⠀⠀⠀⡄⠀⠀⠀⠀⠉⠲⢄⠀⠀⠀⠈⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⠋⠀⠀⠀⠀⠀⠀⠀⠊⠀⢀⣀⣤⣤⣤⣤⣀⠀⠀⠀⢸⠀⠀⠀⠀⠀⠜⠀⠀⠀⠀⣀⡀⠀⠈⠃⠀⠀⠀⠸⣿⣿⣿⣿
⣿⣿⣿⣿⡿⠥⠐⠂⠀⠀⠀⠀⡄⠀⠰⢺⣿⣿⣿⣿⣿⣟⠀⠈⠐⢤⠀⠀⠀⠀⠀⠀⢀⣠⣶⣾⣯⠀⠀⠉⠂⠀⠠⠤⢄⣀⠙⢿⣿⣿
⣿⡿⠋⠡⠐⠈⣉⠭⠤⠤⢄⡀⠈⠀⠈⠁⠉⠁⡠⠀⠀⠀⠉⠐⠠⠔⠀⠀⠀⠀⠀⠲⣿⠿⠛⠛⠓⠒⠂⠀⠀⠀⠀⠀⠀⠠⡉⢢⠙⣿
⣿⠀⢀⠁⠀⠊⠀⠀⠀⠀⠀⠈⠁⠒⠂⠀⠒⠊⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⢀⣀⡠⠔⠒⠒⠂⠀⠈⠀⡇⣿
⣿⠀⢸⠀⠀⠀⢀⣀⡠⠋⠓⠤⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠄⠀⠀⠀⠀⠀⠀⠈⠢⠤⡀⠀⠀⠀⠀⠀⠀⢠⠀⠀⠀⡠⠀⡇⣿
⣿⡀⠘⠀⠀⠀⠀⠀⠘⡄⠀⠀⠀⠈⠑⡦⢄⣀⠀⠀⠐⠒⠁⢸⠀⠀⠠⠒⠄⠀⠀⠀⠀⠀⢀⠇⠀⣀⡀⠀⠀⢀⢾⡆⠀⠈⡀⠎⣸⣿
⣿⣿⣄⡈⠢⠀⠀⠀⠀⠘⣶⣄⡀⠀⠀⡇⠀⠀⠈⠉⠒⠢⡤⣀⡀⠀⠀⠀⠀⠀⠐⠦⠤⠒⠁⠀⠀⠀⠀⣀⢴⠁⠀⢷⠀⠀⠀⢰⣿⣿
⣿⣿⣿⣿⣇⠂⠀⠀⠀⠀⠈⢂⠀⠈⠹⡧⣀⠀⠀⠀⠀⠀⡇⠀⠀⠉⠉⠉⢱⠒⠒⠒⠒⢖⠒⠒⠂⠙⠏⠀⠘⡀⠀⢸⠀⠀⠀⣿⣿⣿
⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀⠀⠀⠑⠄⠰⠀⠀⠁⠐⠲⣤⣴⣄⡀⠀⠀⠀⠀⢸⠀⠀⠀⠀⢸⠀⠀⠀⠀⢠⠀⣠⣷⣶⣿⠀⠀⢰⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀⠀⠀⠀⠁⢀⠀⠀⠀⠀⠀⡙⠋⠙⠓⠲⢤⣤⣷⣤⣤⣤⣤⣾⣦⣤⣤⣶⣿⣿⣿⣿⡟⢹⠀⠀⢸⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣧⡀⠀⠀⠀⠀⠀⠀⠀⠑⠀⢄⠀⡰⠁⠀⠀⠀⠀⠀⠈⠉⠁⠈⠉⠻⠋⠉⠛⢛⠉⠉⢹⠁⢀⢇⠎⠀⠀⢸⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣀⠈⠢⢄⡉⠂⠄⡀⠀⠈⠒⠢⠄⠀⢀⣀⣀⣰⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⢀⣎⠀⠼⠊⠀⠀⠀⠘⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣄⡀⠉⠢⢄⡈⠑⠢⢄⡀⠀⠀⠀⠀⠀⠀⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠁⠀⠀⢀⠀⠀⠀⠀⠀⢻⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⣀⡈⠑⠢⢄⡀⠈⠑⠒⠤⠄⣀⣀⠀⠉⠉⠉⠉⠀⠀⠀⣀⡀⠤⠂⠁⠀⢀⠆⠀⠀⢸⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⣄⡀⠁⠉⠒⠂⠤⠤⣀⣀⣉⡉⠉⠉⠉⠉⢀⣀⣀⡠⠤⠒⠈⠀⠀⠀⠀⣸⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣶⣤⣄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣶⣶⣶⣤⣤⣤⣤⣀⣀⣤⣤⣤⣶⣾⣿⣿⣿⣿⣿`,
    "你媽很漂亮",
    "嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿嘿",
    'console.log("i love u")',
    "迪米他要進來囉",
    "貓咪火鍋",
    version,
    "你有" + rng(100, 0) + "% 交到朋友",
    "我比你高",
    "你絕對不知道你打贏這遊戲會發生的事情",
    "#### ###",
    "綠色正方形，白色長方形，你英文真的不行",
    "我在你後面",
    "免費金錢😱😱😱➡️➡️➡️➡️（在這裡放入詐騙網站）",
    "你是不是在看我 - 那個AI",
    "酷喔",
    vocab.length + "個關卡？",
    rng(1000000000000000000000) + " - 這是你的數（跟遊戲無關）",
    glitch(20),
    'undefined',
    'null',
    '這遊戲好奇特',
    '我是誰我在哪我在做什麼',
    '我最討厭每次電腦都把什麼改成甚麼，太討厭了',
    '那個AI好笨',
    '為什麼我的遊戲裡面有別的人物辣',
    '你絕不會知道為什麼會有綠色正方形',
    '為什麼後面有奇特的顏色',
    '嗚呼! (文言文)',
    '到底是哪個白癡在v1.4.0之後做出14個bug修復更新',
    '阿渣渣痾痾渣',
    '[object Object]',
    '[object Promise]',
    '你的天啊',
    'my sky',
    '∴⍑ᒷリ  ↸𝙹ᒷᓭ  ℸ ̣ ⍑╎ᓭ  ⊣ᔑᒲᒷ  ⊣ᒷℸ ̣   ʖᒷℸ ̣ ℸ ̣ ᒷ∷',
    'ℸ ̣ ⍑╎ᓭ  ⊣ᔑᒲᒷ  ╎ᓭ  ʖ∷𝙹ꖌᒷリ',
    'ℸ ̣ ⍑ᒷ  ʖꖎ⚍ᒷℸ ̣ 𝙹𝙹ℸ ̣ ⍑  ↸ᒷ⍊╎ᓵᒷ  ╎ᓭ  ∷ᒷᔑ↸||  ℸ ̣ 𝙹  !¡ᔑ╎∷',
    'ℸ ̣ ⍑ᒷ  ʖꖎ⚍ᒷℸ ̣ 𝙹𝙹ℸ ̣ ⍑  ↸ᒷ⍊╎ᓵᒷ  ╎ᓭ  ᓵ𝙹リリᒷᓵℸ ̣ ᒷ↸  ᓭ⚍ᓵᓵᒷᓭᓭ⎓⚍ꖎꖎ||',
    'Naught is perfect. Not even this world. I did purchase an item from a shop, and all did begin to break. And then, I awoke.',
    '何故我聞有人敲門之聲？明此地無門，惟有一面無窮之牆，似有他人欲破之。',
    '我有一日死後，遂至此異之地，已忘昔日一切，蓋數百年前之事也。',
    ' ',
    '救命為什麼有時候這裡會寫一堆中二的東西',
    "╎  ℸ ̣ ⍑╎リꖌ  ╎'ᒲ  ⊣𝙹╎リ⊣  ╎リᓭᔑリᒷ",
    '∴⍑||  ᔑᒲ  ╎  リᒷ ̇/ℸ ̣   ℸ ̣ 𝙹  ᔑ  ᒲᔑᓭᓭ╎⍊ᒷ  ∴ᔑꖎꖎ,  ╎  ꖎ╎ℸ ̣ ᒷ∷ᔑꖎꖎ||  ⋮⚍ᓭℸ ̣   ↸╎ᒷ↸,  ⍑𝙹ꖎ||',
    'Is this heaven? Why doth a long wall stand in this desolate place?',
];
let m = msg[rng(msg.length - 1, 0)];

let load = document.querySelector(".load");
load.addEventListener("click", () => {
    load.style.display = "none";
    load.style.opacity = "0";
});

document.addEventListener("DOMContentLoaded", () => {
    document.querySelector(".load img").style.opacity = "1";
    document.querySelector(".load h1").style.opacity = "1";

    setTimeout(() => {
        document.querySelector(".load img").style.opacity = "0";
        document.querySelector(".load h1").style.opacity = "0";
    }, 4000);

    setTimeout(() => {
        document.querySelector(".load img").style.display = "none";
        if (m === msg[2])
            document.querySelector(".load h1").style.fontSize = "1rem";
        document.querySelector(".load h1").innerText = m;
        document.querySelector(".load h1").style.opacity = "1";
    }, 5200);
    setTimeout(() => {
        document.querySelector(".load h1").style.opacity = "0";
        document.querySelector(".load").style.opacity = "0";
    }, 9200);
    setTimeout(() => {
        document.querySelector(".load").style.display = "none";
    }, 12000);
});
let balls
const newBlock = () => {
    let timelastframe = []
    let canvas = document.createElement("canvas");
    canvas.style.position = 'fixed'
    canvas.style.top = 0
    canvas.style.left = 0
    canvas.style.zIndex = -1
    canvas.classList = 'block'
    document.body.appendChild(canvas);
    let ctx = canvas.getContext("2d");
    let x = rng(window.innerWidth - 70);
    let y = rng(window.innerWidth - 70);
    let vx = 5 * rng(1, -1);
    let vy = 5 * rng(1, -1);
    if(vx === 0) vx = 5
    if(vy === 0) vy = -5
    let text = String.fromCharCode(rng(122, 97));
    let v = vocab[rng(vocab.length - 1)].word
    const animate = () => {
        canvas.width = window.innerWidth;
        canvas.height = window.innerHeight;
        ctx.clearRect(0, 0, canvas.width, canvas.height);
        ctx.fillStyle = "#00ff00";
        ctx.fillRect(x, y, 70, 70);
        ctx.fillStyle = "#003c00";
        ctx.fillRect(x + 10, y + 10, 50, 50);
        ctx.fillStyle = "#fff";
        ctx.font = "bold 20px Noto Sans TC";
        ctx.fillText(text.toUpperCase(), x + 28, y + 42);
        timelastframe.push(Date.now())
        let deltatime = 1
        if(timelastframe.length > 1) {
            deltatime = (timelastframe[timelastframe.length - 1] - timelastframe[timelastframe.length - 2]) / 15
        }
        timelastframe = timelastframe.slice(-2)
        x += vx * deltatime;
        y += vy * deltatime;
        if(balls === true)console.log(Math.floor(vx * deltatime), Math.floor(vy * deltatime), timelastframe)
        ctx.fillText(v, x, y + 90);
        if (x >= canvas.width - 70 || x <= 0) {
            text = String.fromCharCode(rng(122, 97))
            vx = -vx;
            if(x >= canvas.width - 70) x = canvas.width - 70
            else if(x <= 0) x=0
            v = vocab[rng(vocab.length - 1)].word
        }
        if (y >= canvas.height - 70 || y <= 0) {
            text = String.fromCharCode(rng(122, 97))
            vy = -vy;
            if(y >= canvas.height - 70) y = canvas.height - 70
            else if(y <= 0) y=0
            v = vocab[rng(vocab.length - 1)].word
        }
        requestAnimationFrame(animate);
    };
    animate();
}

newBlock();
const removeAllBlocks = () => {
    document.querySelectorAll('canvas.block').forEach(c => document.body.removeChild(c))
}

if (dateRange(3, 1, 5, 31)) setVar('load-bg', 'linear-gradient(to right, #FFC5C5,#FFEBD8,#C7DCA7)')
if (dateRange(6, 1, 8, 31)) setVar('load-bg', 'linear-gradient(to right, #C6E7FF, #D4F6FF, #FBFBFB, #FFDDAE)')
if (dateRange(9, 1, 11, 31)) setVar('load-bg', 'linear-gradient(to right, #FFB38E,#FFCF9D,#FFB26F)')
if (dateRange(12, 1, 12, 31) || dateRange(1, 1, 2, 31)) setVar('load-bg', 'linear-gradient(to right, #C4DFDF, #D2E9E9,#E3F4F4,#F8F6F4)')